#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-keycloak_cust/runs/run-cFUfxxm75kEFbbG2

Waiting for the plan to start...

Terraform v0.15.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ab3ae44b-725a-42f8-bcc2-98a4be33783d]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_openid_client.this: Refreshing state... [id=74f33d41-8079-4d5e-9e9f-0fb3f6109ad9]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=ee54c1c6-23c8-4be7-9463-25881f78dd53]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3df466d9-10ea-4046-adc1-22e0fe9dba3f]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_openid_client.this: Refreshing state... [id=e5208611-d26a-47ee-a031-3e05cf726793]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=0c62f2ce-c27e-4173-b692-57789a7a9bc7]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_openid_client.this: Refreshing state... [id=4b54d5af-2fa4-45fa-ad25-966184e0c812]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=4665917c-4624-4e76-8dda-15d05c596f0a]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_openid_client.this: Refreshing state... [id=bf8949c5-5a2b-4444-a71a-8b16df5ba634]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ff29fbf0-c2a0-4f4d-ae30-000529dcb8b4]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2cac2751-fab8-43b2-a039-3df4688c7855]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4d1e1a56-10fa-4e08-8390-107290ee1cb8]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bdf21b43-a3b7-4194-900e-6236996b3567]
module.keycloak_dev.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=889742ce-e722-4e9b-82fb-5ae522d3b0b8]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e20f31c0-6a4b-44fd-98c2-d9210456df34]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=12ce064d-e521-4626-a4e8-6f95fe6cdd80]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3c4fbad9-e32a-46eb-84fd-0361ab7a6094]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a2bea357-902a-4419-9436-371f028420cf]
module.keycloak_dev.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a5434c9d-400c-4d17-8712-8a992d506e46]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=26f2fc8f-0c8c-417a-ba8a-ff22a76c5ce9]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=e326e182-06ba-4007-b111-a34a369001ba]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=602df616-9e86-41a7-8877-fe684ecabff1]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_openid_client.this: Refreshing state... [id=934c9beb-0886-4f5d-a0bd-4482c0bdcd9d]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=75d6c120-1cb3-47a0-9cfb-887007f56e43]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=27bb0ecd-8865-476d-a5d5-49b318862d17]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4a64e6b4-6031-423a-b60a-5d4adc255a9c]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6e8d5758-5957-42ee-a09c-85b705220239]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2a2d6d1b-e906-409b-a1c9-f92865467a7b]
module.keycloak_dev.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a72e685b-b22a-4e3e-b912-d517a1397a3e]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=dece0f21-3272-4f8d-947d-0b653c0b384b]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=94d6e111-35e7-4af0-8c2c-5d1edb6bde21]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bb3da34d-4714-4ecb-be42-9e396bed8406]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=3128beca-d686-491b-a8ca-1ad82f7c0680]
module.keycloak_dev.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=657238a1-e83e-45b2-8e98-e339c5ed5336]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=3e8f1e74-984b-4267-8b0f-8b22469fd055]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=29c4eb8c-6ac2-425c-8c9d-fd8b16e5f4ba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7009c9cc-54d1-45b9-bc67-a3d25cf42dd5]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c6eaa078-6965-4f29-85c4-28a4e7f9ae27]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eab68a5f-0f4e-4654-bcb6-7220ffdd74ee]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6e98bf3-929b-450b-a98f-82cd47b03fba]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cc148327-319c-475c-a943-8a313bc7f828]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d5f0ac9d-5d82-4162-9291-7b504da9f90b]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2fa4c6a4-df79-4d65-990b-6ad664f88e84]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=6317c2ef-91bd-46a1-963a-0a7afdeaf7c9]
module.keycloak_dev.module.onestopauth_basic.module.client_testclient-request1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2dc6e22c-402c-4789-a572-9a26cc2a693a]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=b99e92e1-b511-48d0-a667-dec8baa567b8]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=324970c7-bdb6-4f3e-8f8d-797e7d010ac7]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b54e506f-f9ec-4168-8c28-5f0b19c4ecd0]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9233062d-7b5d-4bc8-847d-99dcd6d7dac6]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29935c7c-1439-4665-9d86-02672a8d71ad]
module.keycloak_dev.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=465edd6a-aaa8-4c49-a042-53a56798f582]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=417d247a-5183-4a95-ac72-180fa91bde9b]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=ef30d3ad-5550-4098-9359-9908c0620b62]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_openid_client.this: Refreshing state... [id=e1ad3b73-8922-4609-bf1f-75646cfaa7f4]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73347af8-9d7f-41c6-b41b-57a19bcdd922]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=78a3fbe3-f8de-4d37-a66c-792e6ee66f87]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9c47eb8e-e8cc-4fe5-ad64-cf9a9f4eb7ad]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6fc927d9-9245-4aa1-98ef-441e07cb05ef]
module.keycloak_dev.module.onestopauth_basic.module.client_dds-portfolio.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f4036e5b-1106-4ac4-9830-cba8c1b748a7]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_openid_client.this: Refreshing state... [id=eda9def9-cb65-4bbe-b155-016a4e0efc7b]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_openid_client.this: Refreshing state... [id=802f1d36-b108-4397-a8ec-c21e59dd7cae]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dbb8d93f-8bf6-47ba-9280-f2902412d568]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=db6a1331-bb77-4352-a4db-e70aacbd2dee]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=99202aa7-1878-4183-aa07-d83bed9002ed]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f277c433-dfd2-4e20-a66e-ccfda7059b4c]
module.keycloak_dev.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4c929283-3ab7-4e43-a7e5-65de6046bf18]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6bd54c02-2628-489d-aa5c-3d027abb45da]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=036873cc-1079-4bcc-8d80-28fa3eae032e]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0dd0e9a1-17a5-4289-9e6b-b7bcf38a831e]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=085b8be1-5041-4081-a3aa-d1a3c334a7f5]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd5ed191-1023-443d-a5ce-9e8d4cc4cb6c]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28494fbf-480a-4bbf-bc13-576e074c197d]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d5f9440-3e5f-49b8-a1bb-8a5229dccc16]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b033767f-c3f0-4cc7-8a3a-358d280c4904]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4df5b321-c4b5-4cb5-961b-3b01d71470f1]
module.keycloak_test.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=153d5614-3ea8-4313-beb3-0abaa48d82c0]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5dcccb6-11fc-4959-891f-eb913d465e90]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02a3db30-2c0e-45e1-965e-bd2f527c30d2]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa54bd66-7db0-4edf-aef5-d59c1be7c01a]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=32e4d193-e002-466b-9494-9fc499be1ddd]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47adddae-1f15-494f-a779-2aa73d2fa5e1]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c3f08da7-36c2-4514-b0d9-624cc4ba7e65]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5464af2a-dee3-41a6-816d-021bf5947753]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6a3e3d19-036a-4abd-9b2c-ee1e5094bb51]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a784fbba-d62c-4d46-922d-6ed7e7a46f5f]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=934f5472-219a-417d-8ec5-8aa7bf64c206]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ab394989-a8f2-425c-a1e2-2fac53eccb32]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bdb011bf-561b-48bb-bda4-dd568280e31f]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0946a9f6-b418-434c-979c-a03b865a3597]
module.keycloak_test.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2d7aa8d1-63d1-436b-a556-bfb2702ebbc2]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=29f047e8-c730-4351-bfc6-b52f399dd9ea]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=889351bc-7326-4f44-aad5-ec5fd45ad099]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3d25a5b8-9836-4b23-9366-2a7905eb826c]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=86d6bd6c-b64f-4bc4-ab32-fe4a218edf1f]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=93ce7085-7fbe-4fed-b401-1660f3de7ab3]
module.keycloak_prod.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8840b1e0-5dda-465f-addb-bf87901f6848]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=753fae22-08a1-40e1-b798-0594a06fa2ce]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=aa6681ca-aa63-4fab-93a4-5297ec667657]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6bfab1cc-4a36-47ba-be77-8961227d6ad6]
module.keycloak_prod.module.onestopauth_basic.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=837635b3-fc3a-4442-9148-451f1b74ca55]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3546f442-c3a5-47b6-955d-c6237753da67]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b0f5563b-6697-4ac8-b35d-fd79b3528e28]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3e811139-c682-4c20-ae3f-e49a7ad2a858]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5eeaded1-a96a-4a38-a826-d84f1c5c9210]
module.keycloak_prod.module.onestopauth.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=648884f9-6c6e-4c1f-8c92-156560e7cb49]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5aa5ebed-497c-42a5-b8be-518ba04f74ca]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c0560048-7b7c-4259-8ce3-dfee0d977ce5]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=11f414ef-3e8f-4c2b-8379-4bc85f8d2051]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e556d93f-00bf-43b2-a8ea-4271ceca49ae]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=12875dd8-82e1-47df-84a1-2f69914ed41d]
module.keycloak_prod.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8018b07c-9885-4627-9357-dd02d7942553]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9cdc2c58-be72-401c-89bd-6d066e6c5ae9]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3e106a58-cf5c-40bd-b8d8-f6442eddbb6c]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f0808d6b-4266-4b88-8f1d-b1015ea17b71]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0fb58d49-7dec-4bfd-95af-ac495e2ce6d8]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=77eec50e-f6ca-48cc-8c8d-6efc4a588bb7]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b03898ff-4879-4215-8a48-14c1a5a1d403]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3f6f4d94-f380-4493-8bd3-4d6f4a91897e]
module.keycloak_prod.module.onestopauth.module.client_sso-requests.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=16b42c20-54db-4b49-94fb-bce3fd911c16]
module.keycloak_prod.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c0a7a2a-332c-4d7b-82d3-70a8d91c02be]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sso-test-1-1.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "sso-test-1-1"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sso-test-1-1"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sso-test-1-1.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "sso-test-1-1"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sso-test-1-1"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sso-test-1-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sso-test-1-1.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "sso-test-1-1"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sso-test-1-1"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 144 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @jlangy, Action: `pull_request`*